---
kind: method
id: M:Autodesk.Revit.DB.OverrideGraphicSettings.#ctor(Autodesk.Revit.DB.OverrideGraphicSettings)
source: html/dff43edf-d932-a037-e9a6-82d2374a903d.htm
---
# Autodesk.Revit.DB.OverrideGraphicSettings.#ctor Method

Creates a new instance of an OverrideGraphicSettings object based on an existing OverrideGraphicSettings object.

## Syntax (C#)
```csharp
public OverrideGraphicSettings(
	OverrideGraphicSettings overrideGraphicSettings
)
```

## Parameters
- **overrideGraphicSettings** (`Autodesk.Revit.DB.OverrideGraphicSettings`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null